DeviceProcessEvents
| where DeviceName contains "MAC-" // you can adjust this, depend on naming patern
| where InitiatingProcessFolderPath has "/usr/bin/sudo" or InitiatingProcessFolderPath has "/bin/zsh"
| where ProcessCommandLine has_any ("sudo spctl --master-disable","spctl --master-disable")
| sort by Timestamp desc 
